"""
定義要抓取職缺的公司列表。
鍵為公司名稱，值為該公司在 104 網站上的 ID。
"""
company_list = {
    # 範例公司，請根據需求取消註解或新增
    "中國信託商業銀行": "1ew38w0",
    "永豐金融控股股份有限公司": "10wkawpk",
    "元大金融控股股份有限公司": "wiuk154",
    "凱基金融控股股份有限公司": "wjcsmhk",
    "富邦金融控股股份有限公司": "1jt9s7c",
    "國泰金控_國泰金融控股股份有限公司": "wjct48g",
    "台新新光金融控股股份有限公司": "10wh8zx4",
    "兆豐金融控股股份有限公司": "wiuk500",
    "永豐商業銀行股份有限公司": "13qu7sqo",
    "群益金鼎證券股份有限公司": "ajnfhyw",
    "CMoney集團": "aueqfyg",
    "口袋證券": "as5u8g8",
    "全曜財經": "10r4uuvc",
    "摩爾證券": "1a2x6bkzpy",
    "復華證券": "7e11q60",
    "野村證券": "7qd8jx4",
    "美好證券": "ajo2a6o",
    "富邦綜合證券": "ajo6mtk",
    "MMA PAN ASIA FUND": "1a2x6biix6",
    "進遠有限公司": "1a2x6bkx0b",
    "恒準市場": "d8n6u6o",
    "豐利資本": "1a2x6bmpgn",
}
